Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/gpio.h
/* -------- GPIO_ANSELSET : (GPIO Offset: 0x08) (R/W 32)  -------- */
#define GPIO_ANSELSET_RESETVALUE              _UINT32_(0x00)                                       /*  (GPIO_ANSELSET)   Reset Value */

#define GPIO_ANSELSET_Msk                     _UINT32_(0x00000000)                                 /* (GPIO_ANSELSET) Register Mask  */


/* -------- GPIO_ANSELINV : (GPIO Offset: 0x0C) (R/W 32)  -------- */
#define GPIO_ANSELINV_RESETVALUE              _UINT32_(0x00)                                       /*  (GPIO_ANSELINV)   Reset Value */

#define GPIO_ANSELINV_Msk                     _UINT32_(0x00000000)                                 /* (GPIO_ANSELINV) Register Mask  */


/* -------- GPIO_TRIS : (GPIO Offset: 0x10) (R/W 32)  -------- */
#define GPIO_TRIS_RESETVALUE                  _UINT32_(0x00)                                       /*  (GPIO_TRIS)   Reset Value */

#define GPIO_TRIS_TRIS0_Pos                   _UINT32_(0)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS0_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS0_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS0(value)                (GPIO_TRIS_TRIS0_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS0_Pos)) /* Assigment of value for TRIS0 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS1_Pos                   _UINT32_(1)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS1_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS1_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS1(value)                (GPIO_TRIS_TRIS1_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS1_Pos)) /* Assigment of value for TRIS1 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS2_Pos                   _UINT32_(2)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS2_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS2_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS2(value)                (GPIO_TRIS_TRIS2_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS2_Pos)) /* Assigment of value for TRIS2 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS3_Pos                   _UINT32_(3)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS3_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS3_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS3(value)                (GPIO_TRIS_TRIS3_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS3_Pos)) /* Assigment of value for TRIS3 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS4_Pos                   _UINT32_(4)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS4_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS4_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS4(value)                (GPIO_TRIS_TRIS4_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS4_Pos)) /* Assigment of value for TRIS4 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS5_Pos                   _UINT32_(5)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS5_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS5_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS5(value)                (GPIO_TRIS_TRIS5_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS5_Pos)) /* Assigment of value for TRIS5 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS6_Pos                   _UINT32_(6)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS6_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS6_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS6(value)                (GPIO_TRIS_TRIS6_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS6_Pos)) /* Assigment of value for TRIS6 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS7_Pos                   _UINT32_(7)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS7_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS7_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS7(value)                (GPIO_TRIS_TRIS7_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS7_Pos)) /* Assigment of value for TRIS7 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS8_Pos                   _UINT32_(8)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS8_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS8_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS8(value)                (GPIO_TRIS_TRIS8_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS8_Pos)) /* Assigment of value for TRIS8 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS9_Pos                   _UINT32_(9)                                          /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS9_Msk                   (_UINT32_(0x1) << GPIO_TRIS_TRIS9_Pos)               /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS9(value)                (GPIO_TRIS_TRIS9_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS9_Pos)) /* Assigment of value for TRIS9 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS10_Pos                  _UINT32_(10)                                         /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS10_Msk                  (_UINT32_(0x1) << GPIO_TRIS_TRIS10_Pos)              /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS10(value)               (GPIO_TRIS_TRIS10_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS10_Pos)) /* Assigment of value for TRIS10 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS13_Pos                  _UINT32_(13)                                         /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS13_Msk                  (_UINT32_(0x1) << GPIO_TRIS_TRIS13_Pos)              /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS13(value)               (GPIO_TRIS_TRIS13_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS13_Pos)) /* Assigment of value for TRIS13 in the GPIO_TRIS register */
#define GPIO_TRIS_TRIS14_Pos                  _UINT32_(14)                                         /* (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS14_Msk                  (_UINT32_(0x1) << GPIO_TRIS_TRIS14_Pos)              /* (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS14(value)               (GPIO_TRIS_TRIS14_Msk & (_UINT32_(value) << GPIO_TRIS_TRIS14_Pos)) /* Assigment of value for TRIS14 in the GPIO_TRIS register */
#define GPIO_TRIS_Msk                         _UINT32_(0x000067FF)                                 /* (GPIO_TRIS) Register Mask  */

