Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/gpio.h
/* -------- GPIO_ODCCLR : (GPIO Offset: 0x44) (R/W 32)  -------- */
#define GPIO_ODCCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_ODCCLR)   Reset Value */

#define GPIO_ODCCLR_Msk                       _UINT32_(0x00000000)                                 /* (GPIO_ODCCLR) Register Mask  */


/* -------- GPIO_ODCSET : (GPIO Offset: 0x48) (R/W 32)  -------- */
#define GPIO_ODCSET_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_ODCSET)   Reset Value */

#define GPIO_ODCSET_Msk                       _UINT32_(0x00000000)                                 /* (GPIO_ODCSET) Register Mask  */


/* -------- GPIO_ODCINV : (GPIO Offset: 0x4C) (R/W 32)  -------- */
#define GPIO_ODCINV_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_ODCINV)   Reset Value */

#define GPIO_ODCINV_Msk                       _UINT32_(0x00000000)                                 /* (GPIO_ODCINV) Register Mask  */


/* -------- GPIO_CNPU : (GPIO Offset: 0x50) (R/W 32)  -------- */
#define GPIO_CNPU_RESETVALUE                  _UINT32_(0x00)                                       /*  (GPIO_CNPU)   Reset Value */

#define GPIO_CNPU_CNPU0_Pos                   _UINT32_(0)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU0_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU0_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU0(value)                (GPIO_CNPU_CNPU0_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU0_Pos)) /* Assigment of value for CNPU0 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU1_Pos                   _UINT32_(1)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU1_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU1_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU1(value)                (GPIO_CNPU_CNPU1_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU1_Pos)) /* Assigment of value for CNPU1 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU2_Pos                   _UINT32_(2)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU2_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU2_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU2(value)                (GPIO_CNPU_CNPU2_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU2_Pos)) /* Assigment of value for CNPU2 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU3_Pos                   _UINT32_(3)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU3_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU3_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU3(value)                (GPIO_CNPU_CNPU3_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU3_Pos)) /* Assigment of value for CNPU3 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU4_Pos                   _UINT32_(4)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU4_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU4_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU4(value)                (GPIO_CNPU_CNPU4_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU4_Pos)) /* Assigment of value for CNPU4 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU5_Pos                   _UINT32_(5)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU5_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU5_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU5(value)                (GPIO_CNPU_CNPU5_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU5_Pos)) /* Assigment of value for CNPU5 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU6_Pos                   _UINT32_(6)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU6_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU6_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU6(value)                (GPIO_CNPU_CNPU6_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU6_Pos)) /* Assigment of value for CNPU6 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU7_Pos                   _UINT32_(7)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU7_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU7_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU7(value)                (GPIO_CNPU_CNPU7_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU7_Pos)) /* Assigment of value for CNPU7 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU8_Pos                   _UINT32_(8)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU8_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU8_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU8(value)                (GPIO_CNPU_CNPU8_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU8_Pos)) /* Assigment of value for CNPU8 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU9_Pos                   _UINT32_(9)                                          /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU9_Msk                   (_UINT32_(0x1) << GPIO_CNPU_CNPU9_Pos)               /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU9(value)                (GPIO_CNPU_CNPU9_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU9_Pos)) /* Assigment of value for CNPU9 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU10_Pos                  _UINT32_(10)                                         /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU10_Msk                  (_UINT32_(0x1) << GPIO_CNPU_CNPU10_Pos)              /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU10(value)               (GPIO_CNPU_CNPU10_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU10_Pos)) /* Assigment of value for CNPU10 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU11_Pos                  _UINT32_(11)                                         /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU11_Msk                  (_UINT32_(0x1) << GPIO_CNPU_CNPU11_Pos)              /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU11(value)               (GPIO_CNPU_CNPU11_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU11_Pos)) /* Assigment of value for CNPU11 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU12_Pos                  _UINT32_(12)                                         /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU12_Msk                  (_UINT32_(0x1) << GPIO_CNPU_CNPU12_Pos)              /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU12(value)               (GPIO_CNPU_CNPU12_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU12_Pos)) /* Assigment of value for CNPU12 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU13_Pos                  _UINT32_(13)                                         /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU13_Msk                  (_UINT32_(0x1) << GPIO_CNPU_CNPU13_Pos)              /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU13(value)               (GPIO_CNPU_CNPU13_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU13_Pos)) /* Assigment of value for CNPU13 in the GPIO_CNPU register */
#define GPIO_CNPU_CNPU14_Pos                  _UINT32_(14)                                         /* (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU14_Msk                  (_UINT32_(0x1) << GPIO_CNPU_CNPU14_Pos)              /* (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU14(value)               (GPIO_CNPU_CNPU14_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU14_Pos)) /* Assigment of value for CNPU14 in the GPIO_CNPU register */
#define GPIO_CNPU_Msk                         _UINT32_(0x00007FFF)                                 /* (GPIO_CNPU) Register Mask  */

#define GPIO_CNPU_CNPU_Pos                    _UINT32_(0)                                          /* (GPIO_CNPU Position)  */
#define GPIO_CNPU_CNPU_Msk                    (_UINT32_(0x7FFF) << GPIO_CNPU_CNPU_Pos)             /* (GPIO_CNPU Mask) CNPU */
#define GPIO_CNPU_CNPU(value)                 (GPIO_CNPU_CNPU_Msk & (_UINT32_(value) << GPIO_CNPU_CNPU_Pos)) 

/* -------- GPIO_CNPUCLR : (GPIO Offset: 0x54) (R/W 32)  -------- */
#define GPIO_CNPUCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNPUCLR)   Reset Value */

#define GPIO_CNPUCLR_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNPUCLR) Register Mask  */


/* -------- GPIO_CNPUSET : (GPIO Offset: 0x58) (R/W 32)  -------- */
#define GPIO_CNPUSET_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNPUSET)   Reset Value */

