Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/gpio.h
/* -------- GPIO_CNNECLR : (GPIO Offset: 0xA4) (R/W 32)  -------- */
#define GPIO_CNNECLR_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNNECLR)   Reset Value */

#define GPIO_CNNECLR_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNNECLR) Register Mask  */


/* -------- GPIO_CNNESET : (GPIO Offset: 0xA8) (R/W 32)  -------- */
#define GPIO_CNNESET_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNNESET)   Reset Value */

#define GPIO_CNNESET_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNNESET) Register Mask  */


/* -------- GPIO_CNNEINV : (GPIO Offset: 0xAC) (R/W 32)  -------- */
#define GPIO_CNNEINV_RESETVALUE               _UINT32_(0x00)                                       /*  (GPIO_CNNEINV)   Reset Value */

#define GPIO_CNNEINV_Msk                      _UINT32_(0x00000000)                                 /* (GPIO_CNNEINV) Register Mask  */


/* -------- GPIO_CNF : (GPIO Offset: 0xB0) (R/W 32)  -------- */
#define GPIO_CNF_RESETVALUE                   _UINT32_(0x00)                                       /*  (GPIO_CNF)   Reset Value */

#define GPIO_CNF_CNF0_Pos                     _UINT32_(0)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF0_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF0_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF0(value)                  (GPIO_CNF_CNF0_Msk & (_UINT32_(value) << GPIO_CNF_CNF0_Pos)) /* Assigment of value for CNF0 in the GPIO_CNF register */
#define GPIO_CNF_CNF1_Pos                     _UINT32_(1)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF1_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF1_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF1(value)                  (GPIO_CNF_CNF1_Msk & (_UINT32_(value) << GPIO_CNF_CNF1_Pos)) /* Assigment of value for CNF1 in the GPIO_CNF register */
#define GPIO_CNF_CNF2_Pos                     _UINT32_(2)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF2_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF2_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF2(value)                  (GPIO_CNF_CNF2_Msk & (_UINT32_(value) << GPIO_CNF_CNF2_Pos)) /* Assigment of value for CNF2 in the GPIO_CNF register */
#define GPIO_CNF_CNF3_Pos                     _UINT32_(3)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF3_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF3_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF3(value)                  (GPIO_CNF_CNF3_Msk & (_UINT32_(value) << GPIO_CNF_CNF3_Pos)) /* Assigment of value for CNF3 in the GPIO_CNF register */
#define GPIO_CNF_CNF4_Pos                     _UINT32_(4)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF4_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF4_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF4(value)                  (GPIO_CNF_CNF4_Msk & (_UINT32_(value) << GPIO_CNF_CNF4_Pos)) /* Assigment of value for CNF4 in the GPIO_CNF register */
#define GPIO_CNF_CNF5_Pos                     _UINT32_(5)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF5_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF5_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF5(value)                  (GPIO_CNF_CNF5_Msk & (_UINT32_(value) << GPIO_CNF_CNF5_Pos)) /* Assigment of value for CNF5 in the GPIO_CNF register */
#define GPIO_CNF_CNF6_Pos                     _UINT32_(6)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF6_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF6_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF6(value)                  (GPIO_CNF_CNF6_Msk & (_UINT32_(value) << GPIO_CNF_CNF6_Pos)) /* Assigment of value for CNF6 in the GPIO_CNF register */
#define GPIO_CNF_CNF7_Pos                     _UINT32_(7)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF7_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF7_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF7(value)                  (GPIO_CNF_CNF7_Msk & (_UINT32_(value) << GPIO_CNF_CNF7_Pos)) /* Assigment of value for CNF7 in the GPIO_CNF register */
#define GPIO_CNF_CNF8_Pos                     _UINT32_(8)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF8_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF8_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF8(value)                  (GPIO_CNF_CNF8_Msk & (_UINT32_(value) << GPIO_CNF_CNF8_Pos)) /* Assigment of value for CNF8 in the GPIO_CNF register */
#define GPIO_CNF_CNF9_Pos                     _UINT32_(9)                                          /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF9_Msk                     (_UINT32_(0x1) << GPIO_CNF_CNF9_Pos)                 /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF9(value)                  (GPIO_CNF_CNF9_Msk & (_UINT32_(value) << GPIO_CNF_CNF9_Pos)) /* Assigment of value for CNF9 in the GPIO_CNF register */
#define GPIO_CNF_CNF10_Pos                    _UINT32_(10)                                         /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF10_Msk                    (_UINT32_(0x1) << GPIO_CNF_CNF10_Pos)                /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF10(value)                 (GPIO_CNF_CNF10_Msk & (_UINT32_(value) << GPIO_CNF_CNF10_Pos)) /* Assigment of value for CNF10 in the GPIO_CNF register */
#define GPIO_CNF_CNF11_Pos                    _UINT32_(11)                                         /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF11_Msk                    (_UINT32_(0x1) << GPIO_CNF_CNF11_Pos)                /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF11(value)                 (GPIO_CNF_CNF11_Msk & (_UINT32_(value) << GPIO_CNF_CNF11_Pos)) /* Assigment of value for CNF11 in the GPIO_CNF register */
#define GPIO_CNF_CNF12_Pos                    _UINT32_(12)                                         /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF12_Msk                    (_UINT32_(0x1) << GPIO_CNF_CNF12_Pos)                /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF12(value)                 (GPIO_CNF_CNF12_Msk & (_UINT32_(value) << GPIO_CNF_CNF12_Pos)) /* Assigment of value for CNF12 in the GPIO_CNF register */
#define GPIO_CNF_CNF13_Pos                    _UINT32_(13)                                         /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF13_Msk                    (_UINT32_(0x1) << GPIO_CNF_CNF13_Pos)                /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF13(value)                 (GPIO_CNF_CNF13_Msk & (_UINT32_(value) << GPIO_CNF_CNF13_Pos)) /* Assigment of value for CNF13 in the GPIO_CNF register */
#define GPIO_CNF_CNF14_Pos                    _UINT32_(14)                                         /* (GPIO_CNF)  Position */
#define GPIO_CNF_CNF14_Msk                    (_UINT32_(0x1) << GPIO_CNF_CNF14_Pos)                /* (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF14(value)                 (GPIO_CNF_CNF14_Msk & (_UINT32_(value) << GPIO_CNF_CNF14_Pos)) /* Assigment of value for CNF14 in the GPIO_CNF register */
#define GPIO_CNF_Msk                          _UINT32_(0x00007FFF)                                 /* (GPIO_CNF) Register Mask  */

