Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/gpio.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief GPIO register API structure */
typedef struct
{
  __IO  uint32_t                       GPIO_ANSEL;         /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       GPIO_ANSELCLR;      /**< Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       GPIO_ANSELSET;      /**< Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       GPIO_ANSELINV;      /**< Offset: 0x0C (R/W  32)  */
  __IO  uint32_t                       GPIO_TRIS;          /**< Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       GPIO_TRISCLR;       /**< Offset: 0x14 (R/W  32)  */
  __IO  uint32_t                       GPIO_TRISSET;       /**< Offset: 0x18 (R/W  32)  */
  __IO  uint32_t                       GPIO_TRISINV;       /**< Offset: 0x1C (R/W  32)  */
  __IO  uint32_t                       GPIO_PORT;          /**< Offset: 0x20 (R/W  32)  */
  __IO  uint32_t                       GPIO_PORTCLR;       /**< Offset: 0x24 (R/W  32)  */
  __IO  uint32_t                       GPIO_PORTSET;       /**< Offset: 0x28 (R/W  32)  */
  __IO  uint32_t                       GPIO_PORTINV;       /**< Offset: 0x2C (R/W  32)  */
  __IO  uint32_t                       GPIO_LAT;           /**< Offset: 0x30 (R/W  32)  */
  __IO  uint32_t                       GPIO_LATCLR;        /**< Offset: 0x34 (R/W  32)  */
  __IO  uint32_t                       GPIO_LATSET;        /**< Offset: 0x38 (R/W  32)  */
  __IO  uint32_t                       GPIO_LATINV;        /**< Offset: 0x3C (R/W  32)  */
  __IO  uint32_t                       GPIO_ODC;           /**< Offset: 0x40 (R/W  32)  */
  __IO  uint32_t                       GPIO_ODCCLR;        /**< Offset: 0x44 (R/W  32)  */
  __IO  uint32_t                       GPIO_ODCSET;        /**< Offset: 0x48 (R/W  32)  */
  __IO  uint32_t                       GPIO_ODCINV;        /**< Offset: 0x4C (R/W  32)  */
  __IO  uint32_t                       GPIO_CNPU;          /**< Offset: 0x50 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNPUCLR;       /**< Offset: 0x54 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNPUSET;       /**< Offset: 0x58 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNPUINV;       /**< Offset: 0x5C (R/W  32)  */
  __IO  uint32_t                       GPIO_CNPD;          /**< Offset: 0x60 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNPDCLR;       /**< Offset: 0x64 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNPDSET;       /**< Offset: 0x68 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNPDINV;       /**< Offset: 0x6C (R/W  32)  */
  __IO  uint32_t                       GPIO_CNCON;         /**< Offset: 0x70 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNCONCLR;      /**< Offset: 0x74 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNCONSET;      /**< Offset: 0x78 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNCONINV;      /**< Offset: 0x7C (R/W  32)  */
  __IO  uint32_t                       GPIO_CNEN;          /**< Offset: 0x80 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNENCLR;       /**< Offset: 0x84 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNENSET;       /**< Offset: 0x88 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNENINV;       /**< Offset: 0x8C (R/W  32)  */
  __IO  uint32_t                       GPIO_CNSTAT;        /**< Offset: 0x90 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNSTATCLR;     /**< Offset: 0x94 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNSTATSET;     /**< Offset: 0x98 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNSTATINV;     /**< Offset: 0x9C (R/W  32)  */
  __IO  uint32_t                       GPIO_CNNE;          /**< Offset: 0xA0 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNNECLR;       /**< Offset: 0xA4 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNNESET;       /**< Offset: 0xA8 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNNEINV;       /**< Offset: 0xAC (R/W  32)  */
  __IO  uint32_t                       GPIO_CNF;           /**< Offset: 0xB0 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNFCLR;        /**< Offset: 0xB4 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNFSET;        /**< Offset: 0xB8 (R/W  32)  */
  __IO  uint32_t                       GPIO_CNFINV;        /**< Offset: 0xBC (R/W  32)  */
  __IO  uint32_t                       GPIO_SRCON0;        /**< Offset: 0xC0 (R/W  32)  */
  __IO  uint32_t                       GPIO_SRCON0CLR;     /**< Offset: 0xC4 (R/W  32)  */
  __IO  uint32_t                       GPIO_SRCON0SET;     /**< Offset: 0xC8 (R/W  32)  */
  __IO  uint32_t                       GPIO_SRCON0INV;     /**< Offset: 0xCC (R/W  32)  */
  __IO  uint32_t                       GPIO_SRCON1;        /**< Offset: 0xD0 (R/W  32)  */
  __IO  uint32_t                       GPIO_SRCON1CLR;     /**< Offset: 0xD4 (R/W  32)  */
  __IO  uint32_t                       GPIO_SRCON1SET;     /**< Offset: 0xD8 (R/W  32)  */
  __IO  uint32_t                       GPIO_SRCON1INV;     /**< Offset: 0xDC (R/W  32)  */
} gpio_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ45_GPIO_COMPONENT_H_ */
